### Report for email-and-alerting on environment: dev

#### Terraform Format and Style 🖌`success`
<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 3.74"...
- Installing hashicorp/aws v3.76.1...
- Installed hashicorp/aws v3.76.1 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan (1 to add, 11 to change, 0 to destroy)</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.email_report_cloudwatch_log_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "email_report_cloudwatch_log_access" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + "arn:aws:logs:eu-west-2:343515223843:log-group:/aws/lambda/dev-email-report-lambda:*",
            ]
          + sid       = "CloudwatchLogs"
        }
    }

  # data.aws_iam_policy_document.log_alerts_cloudwatch_log_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "log_alerts_cloudwatch_log_access" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + "arn:aws:logs:eu-west-2:343515223843:log-group:/aws/lambda/dev-gp2gp-dashboard-alert-lambda:*",
              + "arn:aws:logs:eu-west-2:343515223843:log-group:/aws/lambda/dev-log-alerts-pipeline-error-lambda:*",
              + "arn:aws:logs:eu-west-2:343515223843:log-group:/aws/lambda/dev-log-alerts-technical-failures-above-threshold-lambda:*",
            ]
          + sid       = "CloudwatchLogs"
        }
    }

  # aws_cloudwatch_log_group.email_report_lambda will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "email_report_lambda" {
        id                = "/aws/lambda/dev-email-report-lambda"
        name              = "/aws/lambda/dev-email-report-lambda"
      ~ tags              = {
            "ApplicationRole"     = "AwsCloudwatchLogGroup"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-email-report-lambda"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
      ~ tags_all          = {
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            # (19 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.gp2gp_dashboard_alert will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "gp2gp_dashboard_alert" {
        id                = "/aws/lambda/dev-gp2gp-dashboard-alert-lambda"
        name              = "/aws/lambda/dev-gp2gp-dashboard-alert-lambda"
      ~ tags              = {
            "ApplicationRole"     = "AwsCloudwatchLogGroup"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-gp2gp-dashboard-alert-lambda"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
      ~ tags_all          = {
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            # (19 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.log_alerts_pipeline_error will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "log_alerts_pipeline_error" {
        id                = "/aws/lambda/dev-log-alerts-pipeline-error-lambda"
        name              = "/aws/lambda/dev-log-alerts-pipeline-error-lambda"
      ~ tags              = {
            "ApplicationRole"     = "AwsCloudwatchLogGroup"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-log-alerts-pipeline-error-lambda"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
      ~ tags_all          = {
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            # (19 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.log_alerts_technical_failures_above_threshold will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "log_alerts_technical_failures_above_threshold" {
        id                = "/aws/lambda/dev-log-alerts-technical-failures-above-threshold-lambda"
        name              = "/aws/lambda/dev-log-alerts-technical-failures-above-threshold-lambda"
      ~ tags              = {
            "ApplicationRole"     = "AwsCloudwatchLogGroup"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-log-alerts-technical-failures-above-threshold-lambda"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
      ~ tags_all          = {
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            # (19 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.email_report_cloudwatch_log_access will be updated in-place
  ~ resource "aws_iam_policy" "email_report_cloudwatch_log_access" {
        id          = "arn:aws:iam::343515223843:policy/dev-email-report-cloudwatch-log-access"
        name        = "dev-email-report-cloudwatch-log-access"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:eu-west-2:343515223843:log-group:/aws/lambda/dev-email-report-lambda:*"
                      - Sid      = "CloudwatchLogs"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (6 unchanged attributes hidden)
    }

  # aws_iam_policy.log_alerts_cloudwatch_log_access will be updated in-place
  ~ resource "aws_iam_policy" "log_alerts_cloudwatch_log_access" {
        id          = "arn:aws:iam::343515223843:policy/dev-log-alerts-cloudwatch-log-access"
        name        = "dev-log-alerts-cloudwatch-log-access"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:eu-west-2:343515223843:log-group:/aws/lambda/dev-log-alerts-technical-failures-above-threshold-lambda:*",
                          - "arn:aws:logs:eu-west-2:343515223843:log-group:/aws/lambda/dev-log-alerts-pipeline-error-lambda:*",
                          - "arn:aws:logs:eu-west-2:343515223843:log-group:/aws/lambda/dev-gp2gp-dashboard-alert-lambda:*",
                        ]
                      - Sid      = "CloudwatchLogs"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (6 unchanged attributes hidden)
    }

  # aws_lambda_function.email_report_lambda will be updated in-place
  ~ resource "aws_lambda_function" "email_report_lambda" {
        id                             = "dev-email-report-lambda"
      ~ last_modified                  = "2025-10-23T10:06:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "fcWqh0igHn+LlB7Qqu9q4Ow5jZim7zZNo+du3SK6Ygw=" -> "KNKV79MfGyeDmW6/WrOB6WmKwx+qthH0R/KRldnlKsU="
        tags                           = {
            "ApplicationRole"     = "AwsLambdaFunction"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
            "CreatedBy"           = "gp2gp-reporting-infrastructure"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-email-report-lambda"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.gp2gp_dashboard_alert_lambda will be updated in-place
  ~ resource "aws_lambda_function" "gp2gp_dashboard_alert_lambda" {
        id                             = "dev-gp2gp-dashboard-alert-lambda"
      ~ last_modified                  = "2025-10-23T10:06:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "CWAkWBzxleXV03QxeG861ggXdmz+XwVq8kbt8pO2ado=" -> "1bPLTDB40RxAubIHPtmVsFKDSTfP0SeFwVjhOd5kjn0="
        tags                           = {
            "ApplicationRole"     = "AwsLambdaFunction"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
            "CreatedBy"           = "gp2gp-reporting-infrastructure"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-gp2gp-dashboard-alert-lambda"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.log_alerts_pipeline_error_lambda will be updated in-place
  ~ resource "aws_lambda_function" "log_alerts_pipeline_error_lambda" {
        id                             = "dev-log-alerts-pipeline-error-lambda"
      ~ last_modified                  = "2025-10-23T10:06:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "P55iSJ0fPKSLkll41kekcaqi3uV1YV7Kp+gnTBXRI2E=" -> "UQTKiMtOceRIZpD+sElBEp9vVRtCTbC6U6mM+37GIS0="
        tags                           = {
            "ApplicationRole"     = "AwsLambdaFunction"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
            "CreatedBy"           = "gp2gp-reporting-infrastructure"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-log-alerts-pipeline-error-lambda"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.log_alerts_technical_failures_above_threshold_lambda will be updated in-place
  ~ resource "aws_lambda_function" "log_alerts_technical_failures_above_threshold_lambda" {
        id                             = "dev-log-alerts-technical-failures-above-threshold-lambda"
      ~ last_modified                  = "2025-10-23T10:06:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "JVbD3iKErSzB7fimmtm7/cQZDOK+J8AQByrRhgSxE4c=" -> "+LT28oS1pWhnXn2lSHgDUOIx507G+0LLks/GfA8gRjg="
        tags                           = {
            "ApplicationRole"     = "AwsLambdaFunction"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
            "CreatedBy"           = "gp2gp-reporting-infrastructure"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-log-alerts-technical-failures-above-threshold-lambda"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.store_asid_lookup will be updated in-place
  ~ resource "aws_lambda_function" "store_asid_lookup" {
        id                             = "dev_store_asid_lookup_lambda"
      ~ last_modified                  = "2025-10-23T10:06:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "F82dfZ/3UQXjcJcF/RI0ixUwenP1BIH4qKmDOnHrEJA=" -> "QnGS75+MIc9gB4fPehg8CIQh/7akJk7pkFjuPx1RCTw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket_acl.gp2gp_inbox_storage will be created
  + resource "aws_s3_bucket_acl" "gp2gp_inbox_storage" {
      + acl    = "private"
      + bucket = "prm-gp2gp-inbox-storage-dev"
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

Plan: 1 to add, 11 to change, 0 to destroy.

```

</details>